#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.azure_bot.time_rotating.example: Refreshing state... [id=2023-11-24T05:24:15Z]
module.azure_bot.azuread_application.application: Refreshing state... [id=/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc]
azuread_application.example: Refreshing state... [id=/applications/1d9507e2-cb49-4bf8-ab3a-18dc65565355]
module.azure_bot.azuread_application_password.example: Refreshing state... [id=8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/75c5644f-f001-407a-ae99-89cd0194aa96]
module.azure_bot.azurerm_resource_group.azure_bot_rg: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev]
module.azure_bot.azurerm_bot_service_azure_bot.azure_bot: Refreshing state... [id=/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.azure_bot.azuread_application.application will be updated in-place
  ~ resource "azuread_application" "application" {
      ~ display_name                   = "koichi-furukawa-example-1-dev" -> "koichi-furukawa-example-2-dev"
        id                             = "/applications/8102f76f-6fed-4fed-9a62-ddeff46d05dc"
        tags                           = []
        # (15 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.azure_bot.azuread_application_password.example must be replaced
-/+ resource "azuread_application_password" "example" {
      ~ application_object_id = "8102f76f-6fed-4fed-9a62-ddeff46d05dc" -> (known after apply)
      ~ display_name          = "koichi-furukawa-example-1-dev-client-secret" -> "koichi-furukawa-example-2-dev-client-secret" # forces replacement
      ~ end_date              = "2025-11-24T05:24:16Z" -> (known after apply)
      ~ id                    = "8102f76f-6fed-4fed-9a62-ddeff46d05dc/password/75c5644f-f001-407a-ae99-89cd0194aa96" -> (known after apply)
      ~ key_id                = "75c5644f-f001-407a-ae99-89cd0194aa96" -> (known after apply)
      ~ start_date            = "2023-11-24T05:24:16Z" -> (known after apply)
      ~ value                 = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # module.azure_bot.azurerm_bot_service_azure_bot.azure_bot must be replaced
-/+ resource "azurerm_bot_service_azure_bot" "azure_bot" {
      ~ display_name                 = "koichi-furukawa-example-1-bot-dev" -> (known after apply)
      ~ id                           = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev/providers/Microsoft.BotService/botServices/koichi-furukawa-example-1-bot-dev" -> (known after apply)
      - luis_app_ids                 = [] -> null
      ~ name                         = "koichi-furukawa-example-1-bot-dev" -> "koichi-furukawa-example-2-bot-dev" # forces replacement
      ~ resource_group_name          = "koichi-furukawa-example-1-rg-dev" -> "koichi-furukawa-example-2-rg-dev" # forces replacement
      - tags                         = {} -> null
        # (7 unchanged attributes hidden)
    }

  # module.azure_bot.azurerm_resource_group.azure_bot_rg must be replaced
-/+ resource "azurerm_resource_group" "azure_bot_rg" {
      ~ id       = "/subscriptions/0dccf176-bf7a-4786-8290-4fa07326175a/resourceGroups/koichi-furukawa-example-1-rg-dev" -> (known after apply)
      ~ name     = "koichi-furukawa-example-1-rg-dev" -> "koichi-furukawa-example-2-rg-dev" # forces replacement
      - tags     = {} -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kooooichi24, Action: `pull_request`, Working Directory: `./dev`, Workflow: `Terraform Plan`*